{
  "Articles": [
    {
      "id": 1,
      "Title": "Fat Loss",
      "ImageUrl": "https://cdn.pixabay.com/photo/2015/07/28/16/31/blueberries-864628_640.jpg",
      "article": "Title: Good Nutrition for Effective Fat Loss: A Balanced Approach\n\nIntroduction:\n\nLosing fat and achieving a leaner body is a common health and fitness goal for many individuals. While exercise plays a crucial role in fat loss, proper nutrition is equally important. Adopting a balanced and sustainable approach to nutrition can lead to effective fat loss while supporting overall health and well-being. In this article, we will explore essential principles of good nutrition to help you reach your fat loss goals in a healthy and realistic way.\n\nCreate a Calorie Deficit:\n\nTo lose fat, you must create a calorie deficit, which means consuming fewer calories than your body expends. However, it's crucial to avoid extreme calorie restrictions, as they can lead to nutrient deficiencies and potential health risks. Instead, aim for a modest calorie deficit that promotes steady and sustainable fat loss over time.\n\nPrioritize Whole, Nutrient-Dense Foods:\n\nFocusing on nutrient-dense foods is key to achieving fat loss while maintaining proper nutrition. Include a variety of colorful fruits and vegetables, whole grains, lean proteins (such as chicken, turkey, fish, tofu, and legumes), and healthy fats (like avocados, nuts, and olive oil) in your diet. These foods provide essential vitamins, minerals, and antioxidants to support overall health.\n\nControl Portion Sizes:\n\nEven when consuming nutrient-dense foods, portion control is essential for fat loss. Be mindful of portion sizes and avoid overeating, especially with calorie-dense foods. Utilize smaller plates, chew slowly, and listen to your body's hunger and fullness cues to avoid unnecessary calorie intake.\n\nReduce Added Sugars and Processed Foods:\n\nLimiting added sugars and processed foods is crucial for effective fat loss. These items can contribute to weight gain and offer little nutritional value. Instead, opt for whole, unprocessed foods that provide sustained energy and promote better satiety.\n\nHydrate Adequately:\n\nStaying well-hydrated is vital for fat loss and overall health. Drinking plenty of water throughout the day can help control appetite, support digestion, and optimize metabolism. Aim to drink at least 8 cups (64 ounces) of water daily and adjust your intake based on activity levels and climate.\n\nInclude Lean Protein in Every Meal:\n\nProtein is a key macronutrient for fat loss, as it helps preserve lean muscle mass while promoting satiety. Include a source of lean protein in every meal, such as chicken, turkey, eggs, Greek yogurt, or plant-based options like tofu and lentils.\n\nMindful Eating:\n\nPracticing mindful eating can aid in fat loss by helping you recognize hunger and fullness cues. Avoid distractions during meals, savor each bite, and eat slowly to give your body time to signal when it's satisfied.\n\nRegular Meal Timing:\n\nEstablishing regular meal timings can support fat loss by preventing excessive snacking and regulating blood sugar levels. Aim for three balanced meals and 1-2 healthy snacks per day to maintain energy levels and prevent overeating.\n\nConclusion:\n\nAchieving fat loss through good nutrition is a journey that requires patience, consistency, and a balanced approach. Focus on nourishing your body with nutrient-dense foods, controlling portion sizes, and creating a calorie deficit in a sustainable manner. Combined with regular physical activity and a positive mindset, these nutrition principles can help you achieve your fat loss goals while supporting overall health and well-being. Remember that each person's body is unique, so it's essential to find an approach that works best for you and consult with a healthcare professional or registered dietitian for personalized guidance and support."
    },
    {
      "id": 2,
      "Title": "Weight loss",
      "ImageUrl": "https://cdn.pixabay.com/photo/2016/06/07/17/15/yogurt-1442034_640.jpg",
      "article": "Introduction:\n\nEmbarking on a weight loss journey requires a balanced and mindful approach to nutrition. Fad diets and extreme restrictions may yield quick results, but they are often unsustainable and can be detrimental to your health. In this article, we will explore the principles of good nutrition for weight loss, focusing on nourishing your body with nutrient-dense foods and creating healthy habits that promote long-term success.\n\n1. Create a Calorie Deficit:\n\nTo lose weight, you must create a calorie deficit by consuming fewer calories than your body expends. However, it's crucial to strike a balance and avoid drastic calorie restrictions. Aim for a moderate calorie deficit that promotes gradual and sustainable weight loss, typically around 500 to 750 calories less than your maintenance level.\n\n2. Emphasize Nutrient-Dense Foods:\n\nFocus on nutrient-dense foods that provide essential vitamins, minerals, and antioxidants without excess calories. Fill your plate with a variety of colorful fruits and vegetables, lean proteins, whole grains, and healthy fats. These foods not only support weight loss but also enhance overall health and well-being.\n\n3. Mindful Eating:\n\nPracticing mindful eating can transform your relationship with food and support weight loss. Pay attention to hunger and fullness cues, eat slowly, and savor each bite. Avoid distractions like phones or screens during meals to better connect with your body's signals of satiety.\n\n4. Choose Lean Proteins:\n\nProtein is a crucial component of weight loss, as it promotes feelings of fullness and helps preserve lean muscle mass. Incorporate lean protein sources such as chicken, turkey, fish, tofu, legumes, and low-fat dairy into your meals to support your weight loss goals.\n\n5. Hydrate Adequately:\n\nStaying hydrated is essential for weight loss and overall health. Drinking water throughout the day can help control appetite, support digestion, and enhance metabolism. Often, thirst is mistaken for hunger, leading to unnecessary calorie consumption.\n\n6. Control Portion Sizes:\n\nEven when eating nutrient-dense foods, portion control is essential for weight loss. Be mindful of serving sizes and avoid super-sized portions. Use smaller plates to create the illusion of a full plate while reducing calorie intake.\n\n7. Limit Added Sugars and Processed Foods:\n\nReduce your intake of added sugars and processed foods, which can contribute to weight gain and hinder weight loss efforts. Opt for whole, unprocessed foods whenever possible and read labels to identify hidden sugars and unhealthy ingredients.\n\n8. Include Healthy Fats:\n\nHealthy fats are an essential part of a balanced diet and can support weight loss when consumed in moderation. Incorporate sources of unsaturated fats, such as avocados, nuts, seeds, and olive oil, to promote feelings of fullness and improve nutrient absorption.\n\n9. Stay Consistent with Exercise:\n\nPairing good nutrition with regular physical activity is a winning combination for weight loss. Engage in a mix of cardiovascular exercises, strength training, and flexibility exercises to burn calories, build muscle, and enhance metabolism.\n\nConclusion:\n\nGood nutrition is the foundation of a successful weight loss journey. Focus on nourishing your body with nutrient-dense foods, controlling portion sizes, and practicing mindful eating. Remember that sustainable weight loss takes time and patience. Be kind to yourself, celebrate small victories, and embrace a positive mindset as you work towards your weight loss goals. Consult with a registered dietitian or nutrition expert for personalized guidance and support. By adopting a balanced approach to nutrition and making healthy lifestyle choices, you can achieve sustainable weight loss and improve your overall well-being."
    },
    {
      "id": 3,
      "Title": "Muscle gain",
      "ImageUrl": "https://cdn.pixabay.com/photo/2017/02/06/19/25/mandarins-2043983_640.jpg",
      "article": "Introduction:\n\nWhen it comes to building muscle, proper nutrition plays a pivotal role in maximizing your gains and achieving your fitness goals. A well-balanced and nutrient-dense diet is essential for supporting muscle repair, growth, and overall athletic performance. In this article, we will explore the fundamental principles of good nutrition for muscle gain to help you optimize your diet and unlock your full muscle-building potential.\n\n1. Adequate Protein Intake:\n\nProtein is the cornerstone of muscle growth, as it provides the necessary amino acids for repairing and building muscle tissues. Aim to include high-quality protein sources in each meal, such as lean meats (chicken, turkey, beef), fish, eggs, dairy products, legumes, and plant-based proteins like tofu and quinoa. Consuming around 1.2 to 2.2 grams of protein per kilogram of body weight daily will ensure your muscles have the fuel they need to recover and grow.\n\n2. Carbohydrates for Energy:\n\nCarbohydrates are your body's primary energy source during workouts and daily activities. Including complex carbohydrates from whole grains, fruits, and vegetables in your diet will provide sustained energy levels and prevent muscle fatigue during intense training sessions. Aim to consume carbohydrates before and after workouts to optimize performance and recovery.\n\n3. Healthy Fats for Hormonal Support:\n\nDon't fear fats! Healthy fats play a crucial role in hormone production and support overall health. Include sources of unsaturated fats like avocados, nuts, seeds, and olive oil in your meals. These fats contribute to proper hormone function, including testosterone production, which is essential for muscle gain.\n\n4. Stay Hydrated:\n\nProper hydration is often overlooked but is vital for muscle function and recovery. Drink plenty of water throughout the day, especially during workouts, to maintain optimal performance and prevent dehydration. Staying hydrated aids in nutrient delivery to muscles and supports their growth and repair.\n\n5. Timing Matters:\n\nStrategic meal timing can enhance muscle gain. Consume a balanced meal containing protein and carbohydrates within an hour after your workout. This post-workout meal helps replenish glycogen stores and initiates muscle repair and growth. Additionally, consider spacing your protein intake evenly throughout the day to maintain a constant supply of amino acids for your muscles.\n\n6. Don't Skip Meals:\n\nConsistency is key to muscle gain, and skipping meals can hinder your progress. Aim for three main meals and a few protein-rich snacks each day to maintain a positive nitrogen balance and prevent muscle breakdown.\n\n7. Monitor Portion Sizes:\n\nWhile proper nutrition is essential for muscle gain, overeating can lead to unwanted fat gain. Be mindful of portion sizes and aim for balanced meals that provide adequate nutrients without excessive calories. Listen to your body's hunger and satiety cues to avoid overeating.\n\n8. Supplement Wisely:\n\nWhile a well-rounded diet should be your primary focus, certain supplements can complement your nutrition and support muscle growth. Consider incorporating protein powders, creatine, and branched-chain amino acids (BCAAs) to enhance your performance and recovery.\n\nConclusion:\n\nAchieving muscle gain through good nutrition requires a holistic and personalized approach. Prioritize adequate protein intake, consume nutrient-dense carbohydrates and healthy fats, and stay hydrated to fuel your workouts and support muscle recovery. Remember that building muscle takes time, consistency, and dedication. Combine your nutrition efforts with a well-structured workout routine, sufficient rest, and a positive mindset to optimize your muscle-building journey and achieve the strong, muscular physique you desire. Consult with a registered dietitian or nutrition expert to tailor your nutrition plan to your specific needs and goals. With the right nutrition and determination, you can pave the way for a successful muscle gain journey and a healthier, stronger you."
    },
    {
      "id": 4,
      "Title": "Pre-Workout Foods",
      "ImageUrl": "https://cdn.pixabay.com/photo/2018/02/23/19/23/smoothies-3176371_640.jpg",
      "article": "Introduction:\n\nFueling your body with the right nutrients before a workout is essential for maximizing performance and getting the most out of your fitness routine. Pre-workout meals and snacks provide the energy and stamina needed to power through intense workouts and optimize muscle recovery. In this article, we'll explore a variety of pre-workout foods that can boost your energy levels, enhance endurance, and support your fitness goals.\n\n1. Complex Carbohydrates:\n\nComplex carbohydrates are a primary source of energy for your muscles during exercise. Foods rich in complex carbs provide a steady release of glucose, ensuring a sustained energy supply throughout your workout. Opt for whole grains like oatmeal, brown rice, quinoa, and whole wheat bread to fuel your body effectively.\n\n2. Bananas:\n\nBananas are a pre-workout powerhouse. They are packed with easily digestible carbohydrates and natural sugars, making them an excellent choice for a quick energy boost. Additionally, bananas contain potassium, which helps prevent muscle cramps during strenuous workouts.\n\n3. Greek Yogurt:\n\nGreek yogurt is a protein-rich option that contains a good balance of carbohydrates and essential amino acids. The protein in yogurt helps support muscle repair and growth, while the carbs provide energy for your workout. Consider adding some fresh berries or a drizzle of honey to enhance the flavor and nutrient content.\n\n4. Oatmeal with Berries:\n\nA bowl of oatmeal topped with fresh berries is an ideal pre-workout meal. Oats are a slow-digesting carbohydrate that sustains energy levels, and berries are rich in antioxidants that combat exercise-induced oxidative stress. This combination fuels your workout while promoting post-exercise recovery.\n\n5. Whole Fruit Smoothies:\n\nBlend up a delicious whole fruit smoothie with a mix of fruits like berries, mangoes, and bananas. Add some Greek yogurt and a splash of almond milk for a balanced blend of carbs, protein, and healthy fats. Smoothies are convenient and easily digestible, making them a go-to option for busy fitness enthusiasts.\n\n6. Whole Grain Toast with Nut Butter:\n\nWhole grain toast topped with almond or peanut butter is an excellent choice for a pre-workout snack. The combination of complex carbs and healthy fats provides sustained energy, while the protein in nut butter aids in muscle repair and recovery.\n\n7. Energy Bars:\n\nWhen time is limited, energy bars can be a convenient option. Look for bars that are low in added sugars and contain a good balance of carbohydrates, protein, and healthy fats. Read the labels and choose bars with natural ingredients to avoid unnecessary additives.\n\n8. Hydration:\n\nDon't forget the importance of staying hydrated before your workout. Drink plenty of water in the hours leading up to your exercise session to ensure proper hydration. Dehydration can lead to reduced performance and increased risk of injury.\n\nConclusion:\n\nProper pre-workout nutrition sets the stage for a successful fitness session. By incorporating these pre-workout foods into your routine, you can power up your workouts, improve endurance, and promote muscle recovery. Remember that individual nutritional needs may vary, so experiment with different foods and find what works best for your body. Coupled with a well-balanced diet and a consistent exercise regimen, pre-workout nutrition can help you reach your fitness goals and elevate your overall performance."
    },

    {
      "id": 5,
      "Title": "Healthy foods",
      "ImageUrl": "https://cdn.pixabay.com/photo/2016/11/22/23/28/berries-1851161_640.jpg",
      "article": "Introduction:\n\nA well-balanced diet plays a crucial role in supporting your fitness journey, especially if you're hitting the gym regularly. The right combination of nutrients can help enhance your performance, promote muscle recovery, and keep you energized throughout your workouts. In this article, we'll explore a list of healthy foods that are perfect for gym-goers, helping you make the most of your time at the gym and achieve your fitness goals.\n\n1. Lean Protein Sources:\n\nProtein is the building block of muscles, making it an essential nutrient for gym-goers. Include lean protein sources like chicken, turkey, fish, tofu, and legumes in your diet. These foods provide high-quality protein that aids in muscle repair and growth after intense workouts.\n\n2. Greek Yogurt:\n\nGreek yogurt is a versatile and nutritious option for gym-goers. It is packed with protein, probiotics, and calcium. Greek yogurt can be enjoyed as a post-workout snack or as a base for smoothies, adding a creamy texture and a boost of nutrients.\n\n3. Quinoa:\n\nQuinoa is a complete protein source that contains all nine essential amino acids. It's also rich in fiber, vitamins, and minerals, making it an excellent choice for sustaining energy levels during workouts and promoting post-exercise recovery.\n\n4. Nuts and Seeds:\n\nNuts and seeds are nutrient-dense and provide healthy fats, protein, and essential minerals. Almonds, walnuts, chia seeds, and flaxseeds are great options to add to your diet. Sprinkle them over your salads, yogurt, or include them in homemade energy bars for a nutritious boost.\n\n5. Colorful Fruits and Vegetables:\n\nColorful fruits and vegetables are packed with vitamins, minerals, and antioxidants. They provide essential nutrients to support overall health and optimize performance in the gym. Include a variety of colorful produce such as berries, spinach, broccoli, and bell peppers in your meals.\n\n6. Oats:\n\nOats are a complex carbohydrate source that offers sustained energy and helps stabilize blood sugar levels. They are perfect for pre-workout meals to provide long-lasting fuel for your exercise session.\n\n7. Avocado:\n\nAvocado is a rich source of healthy monounsaturated fats, which can aid in joint health and reduce inflammation. Add avocado slices to your sandwiches, salads, or blend them into a creamy avocado smoothie.\n\nConclusion:\n\nFueling your body with the right nutrients is essential for gym-goers seeking to maximize their fitness results. Incorporate lean protein sources, Greek yogurt, quinoa, nuts, seeds, colorful fruits, and vegetables into your diet. Also, don't forget to include oats and avocados to provide sustained energy and support joint health. By nourishing your body with these healthy foods, you'll be better equipped to tackle your workouts, promote muscle recovery, and reach your fitness goals."
    }
  ],
  "workoutPlans": [
    {
      "bodyPart": "waist",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-11-16/N6O90SbKRiiVm_6PF8-TWw.webp",
      "gifUrl": "https://v2.exercisedb.io/image/xMWbwgxZf6mJaV",
      "id": "0001",
      "name": "3/4 sit-up",
      "target": "abs",
      "difficulty": "intermediate",
      "secondaryMuscles": ["hip flexors", "lower back"],
      "instructions": [
        "Lie flat on your back with your knees bent and feet flat on the ground.",
        "Place your hands behind your head with your elbows pointing outwards.",
        "Engaging your abs, slowly lift your upper body off the ground, curling forward until your torso is at a 45-degree angle.",
        "Pause for a moment at the top, then slowly lower your upper body back down to the starting position.",
        "Repeat for the desired number of repetitions."
      ]
    },
    {
      "bodyPart": "waist",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-10-16/64cc281cb5b244a2b4fd415362039df6.webp",
      "gifUrl": "https://v2.exercisedb.io/image/AMf4ywPnTpZQmR",
      "id": "0002",
      "name": "45° side bend",
      "target": "abs",
      "difficulty": "beginner",
      "secondaryMuscles": ["obliques"],
      "instructions": [
        "Stand with your feet shoulder-width apart and your arms extended straight down by your sides.",
        "Keeping your back straight and your core engaged, slowly bend your torso to one side, lowering your hand towards your knee.",
        "Pause for a moment at the bottom, then slowly return to the starting position.",
        "Repeat on the other side.",
        "Continue alternating sides for the desired number of repetitions."
      ]
    },
    {
      "bodyPart": "waist",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-10-24/53f77067344e4558b4aae0e59c5ef663.webp",
      "gifUrl": "https://v2.exercisedb.io/image/nQTZijn3v-Zfz1",
      "id": "0003",
      "name": "air bike",
      "target": "abs",
      "difficulty": "expert",
      "secondaryMuscles": ["hip flexors"],
      "instructions": [
        "Lie flat on your back with your hands placed behind your head.",
        "Lift your legs off the ground and bend your knees at a 90-degree angle.",
        "Bring your right elbow towards your left knee while simultaneously straightening your right leg.",
        "Return to the starting position and repeat the movement on the opposite side, bringing your left elbow towards your right knee while straightening your left leg.",
        "Continue alternating sides in a pedaling motion for the desired number of repetitions."
      ]
    },
    {
      "bodyPart": "upper legs",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-10-09/c3a0813458624fc7a8aa4bc04ff0346e.webp",
      "gifUrl": "https://v2.exercisedb.io/image/P-ZYzUMBExMBGw",
      "id": "1512",
      "name": "all fours squad stretch",
      "target": "quads",
      "difficulty": "intermediate",
      "secondaryMuscles": ["hamstrings", "glutes"],
      "instructions": [
        "Start on all fours with your hands directly under your shoulders and your knees directly under your hips.",
        "Extend one leg straight back, keeping your knee bent and your foot flexed.",
        "Slowly lower your hips towards the ground, feeling a stretch in your quads.",
        "Hold this position for 20-30 seconds.",
        "Switch legs and repeat the stretch on the other side."
      ]
    },
    {
      "bodyPart": "waist",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-10-10/72468cd352b04b049b7a790376ade6b2.webp",
      "gifUrl": "https://v2.exercisedb.io/image/Yx2zNxVMuqZase",
      "id": "0006",
      "name": "alternate heel touchers",
      "target": "abs",
      "difficulty": "beginner",
      "secondaryMuscles": ["obliques"],
      "instructions": [
        "Lie flat on your back with your knees bent and feet flat on the ground.",
        "Extend your arms straight out to the sides, parallel to the ground.",
        "Engaging your abs, lift your shoulders off the ground and reach your right hand towards your right heel.",
        "Return to the starting position and repeat on the left side, reaching your left hand towards your left heel.",
        "Continue alternating sides for the desired number of repetitions."
      ]
    },
    {
      "bodyPart": "back",
      "equipment": "cable",
      "displayImage": "https://pics.craiyon.com/2023-10-17/e3d2f2c9f1ae4c298889a1360a679cf7.webp",
      "gifUrl": "https://v2.exercisedb.io/image/R-LThLqcTos73x",
      "id": "0007",
      "name": "alternate lateral pulldown",
      "target": "lats",
      "difficulty": "expert",
      "secondaryMuscles": ["biceps", "rhomboids"],
      "instructions": [
        "Sit on the cable machine with your back straight and feet flat on the ground.",
        "Grasp the handles with an overhand grip, slightly wider than shoulder-width apart.",
        "Lean back slightly and pull the handles towards your chest, squeezing your shoulder blades together.",
        "Pause for a moment at the peak of the movement, then slowly release the handles back to the starting position.",
        "Repeat for the desired number of repetitions."
      ]
    },
    {
      "bodyPart": "lower legs",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-10-10/72468cd352b04b049b7a790376ade6b2.webp",
      "gifUrl": "https://v2.exercisedb.io/image/HYZdCbP3jL0Mh8",
      "id": "1368",
      "name": "ankle circles",
      "target": "calves",
      "difficulty": "intermediate",
      "secondaryMuscles": ["ankle stabilizers"],
      "instructions": [
        "Sit on the ground with your legs extended in front of you.",
        "Lift one leg off the ground and rotate your ankle in a circular motion.",
        "Perform the desired number of circles in one direction, then switch to the other direction.",
        "Repeat with the other leg."
      ]
    },
    {
      "bodyPart": "back",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-09-28/603cd475d67149a6905e7a60dce2b254.webp",
      "gifUrl": "https://v2.exercisedb.io/image/GenVRtcNAyPjZX",
      "id": "3293",
      "name": "archer pull up",
      "target": "lats",
      "difficulty": "beginner",
      "secondaryMuscles": ["biceps", "forearms"],
      "instructions": [
        "Start by hanging from a pull-up bar with an overhand grip, slightly wider than shoulder-width apart.",
        "Engage your core and pull your shoulder blades down and back.",
        "As you pull yourself up, bend one arm and bring your elbow towards your side, while keeping the other arm straight.",
        "Continue pulling until your chin is above the bar and your bent arm is fully flexed.",
        "Lower yourself back down with control, straightening the bent arm and repeating the movement on the other side.",
        "Alternate sides with each repetition."
      ]
    },
    {
      "bodyPart": "chest",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-11-06/ab9db24f751d435c911a438428f1df4a.webp",
      "gifUrl": "https://v2.exercisedb.io/image/AeUFlsbYBGYfst",
      "id": "3294",
      "name": "archer push up",
      "target": "pectorals",
      "difficulty": "expert",
      "secondaryMuscles": ["triceps", "shoulders", "core"],
      "instructions": [
        "Start in a push-up position with your hands slightly wider than shoulder-width apart.",
        "Extend one arm straight out to the side, parallel to the ground.",
        "Lower your body by bending your elbows, keeping your back straight and core engaged.",
        "Push back up to the starting position.",
        "Repeat on the other side, extending the opposite arm out to the side.",
        "Continue alternating sides for the desired number of repetitions."
      ]
    },
    {
      "bodyPart": "waist",
      "equipment": "body weight",
      "displayImage": "https://pics.craiyon.com/2023-10-23/f4a44044d061485586ea062eea9f56d4.webp",
      "gifUrl": "https://v2.exercisedb.io/image/q4nN8kNFG56JI8",
      "id": "2355",
      "name": "arm slingers hanging bent knee legs",
      "target": "abs",
      "difficulty": "beginner",
      "secondaryMuscles": ["shoulders", "back"],
      "instructions": [
        "Hang from a pull-up bar with your arms fully extended and your knees bent at a 90-degree angle.",
        "Engage your core and lift your knees towards your chest, bringing them as close to your elbows as possible.",
        "Slowly lower your legs back down to the starting position.",
        "Repeat for the desired number of repetitions."
      ]
    },
    {
      "id": "23",
      "name": "Rickshaw Carry",
      "type": "strongman",
      "muscle": "forearms",
      "equipment": "other",
      "difficulty": "beginner",
      "displayImage": "https://pics.craiyon.com/2023-11-20/HC46hE3hQzmCCGVdEM7l-w.webp",
      "gifUrl": "https://v2.exercisedb.io/image/xMWbwgxZf6mJaV",
      "instructions": [
        "Position the frame at the starting point, and load with the appropriate weight.",
        " Standing in the center of the frame, begin by gripping the handles and driving through your heels to lift the frame.",
        " Ensure your chest and head are up and your back is straight.",
        " Immediately begin walking briskly with quick, controlled steps.",
        " Keep your chest up and head forward, and make sure you continue breathing.",
        "Bring the frame to the ground after you have reached the end point."
      ]
    },
    {
      "id": "24",
      "name": "Single-Leg Press",
      "type": "strength",
      "muscle": "quadriceps",
      "equipment": "machine",
      "difficulty": "intermediate",
      "displayImage": "https://pics.craiyon.com/2023-09-15/cd180b919b7d40a7b64afd64e4ee7ae8.webp",
      "gifUrl": "https://v2.exercisedb.io/image/AMf4ywPnTpZQmR",
      "instructions": [
        "Load the sled to an appropriate weight.",
        " Seat yourself on the machine, planting one foot on the platform in line with your hip.",
        " Your free foot can be placed on the ground.",
        " Maintain good spinal position with your head and chest up.",
        " Supporting the weight, fully extend the knee and unlock the sled.",
        " This will be your starting position.",
        " Lower the weight by flexing the hip and knee, continuing as far as flexibility allows.",
        " Do not allow your lumbar to take the load by moving your pelvis.",
        " At the bottom of the motion pause briefly and then return to the starting position by extending the hip and knee.",
        " Complete all repetitions for one leg before switching to the other."
      ]
    },
    {
      "id": "25",
      "name": "Landmine twist",
      "type": "strength",
      "muscle": "abdominal",
      "equipment": "other",
      "difficulty": "intermediate",
      "displayImage": "https://pics.craiyon.com/2023-10-12/2f85ca38fa5e43eda3fa4d80cab14cf9.webp",
      "gifUrl": "https://v2.exercisedb.io/image/nQTZijn3v-Zfz1",
      "instructions": [
        "Position a bar into a landmine or securely anchor it in a corner.",
        " Load the bar to an appropriate weight.",
        " Raise the bar from the floor, taking it to shoulder height with both hands with your arms extended in front of you.",
        " Adopt a wide stance. This will be your starting position.",
        " Perform the movement by rotating the trunk and hips as you swing the weight all the way down to one side.",
        "Keep your arms extended throughout the exercise.",
        " Reverse the motion to swing the weight all the way to the opposite side.",
        " Continue alternating the movement until the set is complete."
      ]
    },
    {
      "id": "26",
      "name": "Weighted pull-up",
      "type": "strength",
      "muscle": "lats",
      "equipment": "other",
      "difficulty": "intermediate",
      "displayImage": "https://pics.craiyon.com/2023-11-05/6c015daab96b48a2bf711f8e34f05c76.webp",
      "gifUrl": "https://v2.exercisedb.io/image/P-ZYzUMBExMBGw",
      "instructions": [
        "Attach a weight to a dip belt and secure it around your waist.",
        " Grab the pull-up bar with the palms of your hands facing forward.",
        " For a medium grip, your hands should be spaced at shoulder width.",
        " Both arms should be extended in front of you holding the bar at the chosen grip.",
        " You'll want to bring your torso back about 30 degrees while creating a curvature in your lower back and sticking your chest out.",
        " This will be your starting position.",
        " Now, exhale and pull your torso up until your head is above your hands.",
        " Concentrate on squeezing your shoulder blades back and down as you reach the top contracted position.",
        " After a brief moment at the top contracted position, inhale and slowly lower your torso back to the starting position with your arms extended and your lats fully stretched."
      ]
    },
    {
      "id": "27",
      "name": "T-Bar Row with Handle",
      "type": "strength",
      "muscle": "middle_back",
      "equipment": "other",
      "difficulty": "intermediate",
      "displayImage": "https://cdn.pixabay.com/photo/2017/04/20/08/35/sport-2245029_1280.jpg",
      "gifUrl": "https://v2.exercisedb.io/image/Yx2zNxVMuqZase",
      "instructions": [
        "Position a bar into a landmine or in a corner to keep it from moving.",
        " Load an appropriate weight onto your end.",
        " Stand over the bar, and position a Double D row handle around the bar next to the collar.",
        " Using your hips and legs, rise to a standing position.",
        " Assume a wide stance with your hips back and your chest up.",
        " Your arms should be extended.",
        " This will be your starting position.",
        "Pull the weight to your upper abdomen by retracting the shoulder blades and flexing the elbows.",
        " Do not jerk the weight or cheat during the movement.",
        " After a brief pause, return to the starting position."
      ]
    },
    {
      "id": "28",
      "name": "Palms-down wrist curl over bench",
      "type": "strength",
      "muscle": "forearms",
      "equipment": "barbell",
      "difficulty": "intermediate",
      "displayImage": "https://cdn.pixabay.com/photo/2017/04/20/08/35/sport-2245029_1280.jpg",
      "gifUrl": "https://v2.exercisedb.io/image/R-LThLqcTos73x",
      "instructions": [
        "Start out by placing a barbell on one side of a flat bench.",
        " Kneel down on both of your knees so that your body is facing the flat bench.",
        " Use your arms to grab the barbell with a pronated grip (palms down) and bring them up so that your forearms are resting against the flat bench.",
        " Your wrists should be hanging over the edge.",
        " Start out by curling your wrist upwards and exhaling.",
        " Slowly lower your wrists back down to the starting position while inhaling.",
        " Your forearms should be stationary as your wrist is the only movement needed to perform this exercise.",
        " Repeat for the recommended amount of repetitions. ",
        " Variations:  This exercise can also be performed sitting down by using your thighs as a resting position for your forearms.",
        " Your wrist can hang over your knees and the same movements as mentioned above can be performed.",
        " You can also use a dumbbell instead of a barbell."
      ]
    },
    {
      "id": "29",
      "name": "Atlas Stones",
      "type": "strongman",
      "muscle": "lower_back",
      "equipment": "other",
      "difficulty": "intermediate",
      "displayImage": "https://cdn.pixabay.com/photo/2017/04/20/08/35/sport-2245029_1280.jpg",
      "gifUrl": "https://v2.exercisedb.io/image/HYZdCbP3jL0Mh8",
      "instructions": [
        "Begin with the atlas stone between your feet.",
        " Bend at the hips to wrap your arms vertically around the Atlas Stone, attempting to get your fingers underneath the stone.",
        " Many stones will have a small flat portion on the bottom, which will make the stone easier to hold.",
        " Pulling the stone into your torso, drive through the back half of your feet to pull the stone from the ground.",
        " As the stone passes the knees, lap it by sitting backward, pulling the stone on top of your thighs.",
        " Sit low, getting the stone high onto your chest as you change your grip to reach over the stone.",
        " Stand, driving through with your hips.",
        " Close distance to the loading platform, and lean back, extending the hips to get the stone as high as possible."
      ]
    },
    {
      "id": "30",
      "name": "Dumbbell front raise to lateral raise",
      "type": "strength",
      "muscle": "shoulders",
      "equipment": "dumbbell",
      "difficulty": "intermediate",
      "displayImage": "https://cdn.pixabay.com/photo/2017/04/20/08/35/sport-2245029_1280.jpg",
      "gifUrl": "https://v2.exercisedb.io/image/GenVRtcNAyPjZX",
      "instructions": [
        "In a standing position, hold a pair of dumbbells at your side.",
        " This will be your starting position.",
        " Keeping your elbows slightly bent, raise the weights directly in front of you to shoulder height, avoiding any swinging or cheating.",
        " At the top of the exercise move the weights out in front of you, keeping your arms extended.",
        " Lower the weights with a controlled motion. On the next repetition, raise the weights in front of you to shoulder height before moving the weights laterally to your sides.",
        "Lower the weights to the starting position."
      ]
    },
    {
      "id": "31",
      "name": "Clean from Blocks",
      "type": "olympic_weightlifting",
      "muscle": "quadriceps",
      "equipment": "barbell",
      "difficulty": "beginner",
      "displayImage": "https://cdn.pixabay.com/photo/2017/04/20/08/35/sport-2245029_1280.jpg",
      "gifUrl": "https://v2.exercisedb.io/image/q4nN8kNFG56JI8",
      "instructions": [
        "With a barbell on boxes or stands of the desired height, take an overhand or hook grip just outside the legs.",
        "Lower your hips with the weight focused on the heels, back straight, head facing forward, chest up, with your shoulders just in front of the bar.",
        " This will be your starting position.",
        " Begin the first pull by driving through the heels, extending your knees.",
        " Your back angle should stay the same, and your arms should remain straight with the elbows pointed out.",
        "Next comes the second pull, the main source of acceleration for the clean.",
        " As the bar approaches the mid-thigh position, begin extending through the hips.",
        " In a jumping motion, accelerate by extending the hips, knees, and ankles, using speed to move the bar upward.",
        " There should be no need to actively pull through the arms to accelerate the weight.",
        " At the end of the second pull, the body should be fully extended, leaning slightly back, with the arms still extended.",
        " As full extension is achieved, transition into the receiving position by aggressively shrugging and flexing the arms with the elbows up and out.",
        " Aggressively pull yourself down, rotating your elbows under the bar as you do so.",
        " Receive the bar in a front squat position, the depth of which is dependent upon the height of the bar at the end of the third pull.",
        " The bar should be racked onto the protracted shoulders, lightly touching the throat with the hands relaxed.",
        " Continue to descend to the bottom squat position, which will help in the recovery.",
        " Immediately recover by driving through the heels, keeping the torso upright and elbows up.",
        " Continue until you have risen to a standing position. Return the weight to the boxes for the next rep."
      ]
    },
    {
      "id": "32",
      "name": "Incline Hammer Curls",
      "type": "strength",
      "muscle": "biceps",
      "equipment": "dumbbell",
      "difficulty": "beginner",
      "displayImage": "https://cdn.pixabay.com/photo/2017/04/20/08/35/sport-2245029_1280.jpg",
      "gifUrl": "https://v2.exercisedb.io/image/xMWbwgxZf6mJaV",
      "instructions": [
        "Seat yourself on an incline bench with a dumbbell in each hand.",
        "You should pressed firmly against he back with your feet together.",
        "Allow the dumbbells to hang straight down at your side, holding them with a neutral grip.",
        "This will be your starting position.",
        "Initiate the movement by flexing at the elbow, attempting to keep the upper arm stationary.",
        "Continue to the top of the movement and pause, then slowly return to the start position."
      ]
    },
    {
      "bodyPart": "lower legs",
      "displayImage": "https://cdn.pixabay.com/photo/2017/04/20/08/35/sport-2245029_1280.jpg",
      "equipment": "body weight",
      "gifUrl": "https://v2.exercisedb.io/image/AMf4ywPnTpZQmR",
      "id": "1368",
      "name": "ankle circles",
      "target": "calves",
      "difficulty": "intermediate",
      "secondaryMuscles": ["ankle stabilizers"],
      "instructions": [
        "Sit on the ground with your legs extended in front of you.",
        "Lift one leg off the ground and rotate your ankle in a circular motion.",
        "Perform the desired number of circles in one direction, then switch to the other direction.",
        "Repeat with the other leg."
      ]
    }
  ],

  "exerciseImageSet": [
    {
      "id": 1,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-amar-preciado-13588102.jpg?updatedAt=1707881886445",
      "description": "Beautiful sunrise,morning run"
    },
    {
      "id": 2,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-cottonbro-studio-7676552.jpg?updatedAt=1707881886337",
      "description": "Feeling strong after workout"
    },
    {
      "id": 3,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-cottonbro-studio-7675412.jpg?updatedAt=1707881886194",
      "description": "Reached my personal best"
    },
    {
      "id": 4,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-airam-datoon-13106577.jpg?updatedAt=1707881886170",
      "description": "Focused during weightlifting"
    },
    {
      "id": 5,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-victor-freitas-841130.jpg?updatedAt=1707881885777",
      "description": "Cool breeze is refreshing"
    },
    {
      "id": 6,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-airam-datoon-13106610.jpg?updatedAt=1707881885809",
      "description": "Building muscle and strength"
    },
    {
      "id": 7,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-cottonbro-studio-4753996.jpg?updatedAt=1707881884134",
      "description": "Running through scenic trails"
    },
    {
      "id": 8,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-cottonbro-studio-4753987.jpg?updatedAt=1707881883174",
      "description": "Challenging,heavier weights"
    },
    {
      "id": 9,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-monstera-production-6999119.jpg?updatedAt=1707881878219",
      "description": "Morning run energizes me"
    },
    {
      "id": 10,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-cottonbro-studio-4761790.jpg?updatedAt=1707881870546",
      "description": "Form,technique are key"
    },
    {
      "id": 11,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-scott-webb-136404.jpg?updatedAt=1707881848552",
      "description": "View the city skyline"
    },
    {
      "id": 12,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-scott-webb-28080.jpg?updatedAt=1707881853283",
      "description": "Pushing limits and goals"
    },
    {
      "id": 13,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-leon-ardho-1552249.jpg?updatedAt=1707881855440",
      "description": "Feeling accomplished after run"
    },
    {
      "id": 14,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-cottonbro-studio-4761790.jpg?updatedAt=1707881870546",
      "description": "Every rep counts progress"
    },
    {
      "id": 15,
      "workout_id": 1,
      "user_id": 1,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-ketut-subiyanto-4720766.jpg?updatedAt=1707881879413",
      "description": "Loving the challenge"
    },
    {
      "id": 16,
      "workout_id": 2,
      "user_id": 2,
      "url": "https://ik.imagekit.io/iqaynsdav/pexels-cottonbro-studio-4753996.jpg?updatedAt=1707881884134",
      "description": "Running through scenic trails"
    }
  ],
  
  "users":[
 
  ]
}
